/** @format */

import React from "react";

const AboutCont = () => {
	return (
		<div className="about__inner">
			<div className="container">
				<div className="about01">
					<img
						src=""
						alt="about이미지1"
						className="about__img"
					/>
					<h3>
						“세상에서 가장 어려운 일은 사람이 사람의 마음을 얻는 일이란다.”
					</h3>
					<div className="about__desc">
						나의 가장 좋아하는 소설인 어린왕자에 나오는 말인 위의 구절은 언제나
						인생을 한번씩 되돌아 보겠금 만드는 구절이다. 사람이 사람의 마음을
						얻는것이 정말 어려운 일이라는 것은 점점 커가면서 비로소 나에게 크게
						다가오는 일이 되었다. 어린왕자에서도 이 이야기의 질문과 대답을
						하는것은 ‘나’이고, 그것을 질문하는 대상은 바로 어린왕자이다.
						살아가면서 점점 하는일도 힘들어지고, 마음을 얻는것은 더욱 어려워
						졌다. 하지만, 그럴수록 나는 노력을 하고 열심히 살아 가야하는 것을
						배우게 되었다. 그런의미에서 새로운 도전에도 포기하지 않고, 열심히
						배우며 살아가고 싶다.
					</div>
				</div>
				<div className="about02">
					<img
						src="/"
						alt="about이미지2"
						className="about__img"
					/>

					<div className="about__desc">
						<h3>
							“그렇지만 기다려야해...”
							<br />
							“뭘 기다려?” <br />
							“해가 지길 기다려야 한단 말이야”
						</h3>
						좋아하는 것을 얻을려면 기다림이 있어야 한다. 기다림은 때로는 힘들고,
						지칠때도 있지만 그 후의 보상은 참으로 값진것이 많다. 좋아하는 것은
						절대 그저 내게 다가 오지 않는다. 내가 행동을 하거나, 기다림을
						실천해야지 비로소 얻을 수 있을 때가 많다. 때로는 힘들고, 지칠때도
						있지만 기다림은 나를 포기하지 않는다. 내가 한 만큼 그만큼의 값진
						것을 나에게 선물해준다. 그렇듯 내가 처음 코딩을 배울때에도 기다림이
						있어야 했다. 나는 이제 이 일을 처음 하는 것이고, 그만큼 좋아하고
						보람을 느낄 려면 기다림은 필수 였다. 그리고 이제 그 기다림이 결실을
						조금씩 맺고 있다.
					</div>
				</div>
				<div className="about03">
					<img
						src=""
						alt="about이미지3"
						className="about__img"
					/>

					<div className="about__desc">
						<h3>
							“다른 사람에게는 결코 열어주지 않는 문을 당신에게만 열어주는
							<br />
							사람이 있다면 그사람이야 말로... <br />
							당신의 진정한 친구다.”
						</h3>
						나에게 새로운 길을 열어준 코딩은 이제 나의 친구가 되었다. 나에게
						열어주지 않을 것 같던 문을 열어주었고, 이제 나는 그 문의 길을 들어갈
						준비를 하는 사람이다. 처음에는 이 문이 과연 열릴까라는 생각을 하기도
						했고, 의심도 했지만... 이제 문이 조금씩 열렸다는 것을 알고나니 더욱
						힘차게 이문을 열고 나아가야 겠다는 생각을 하게 되었다.
					</div>
				</div>
			</div>
		</div>
	);
};

export default AboutCont;
